InformationRegisters/НастройкиОбменаЕИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОбменаЕИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПоследнегоПолученияДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнегоПолученияКонтрактов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторУчастникаДокументооборота</Name>
					<Comment>Строка длиной от 4 до 46 символов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>46</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоСПЗ</Name>
					<Comment>Используется для заказчиков гос.контракта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеОрганизации</Name>
					<Comment>Строка 1000 символов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбменВключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегистрационныйНомерЕРУЗ</Name>
					<Comment>Используется для поставщиков по гос.контракту</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СведенияОПодписантах</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипОрганизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчастниковЭлектронногоАктированияЕИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТокенАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ЭлектронноеАктированиеЕИСВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Есть подсистема актирования для заказчиков.
// 
// Возвращаемое значение:
//  Булево - Истина, если в конфигурации присутствует подсистема для заказчиков.
Функция ЕстьПодсистемаДляЗаказчиков() Экспорт
	
	Возврат ЭлектронноеАктированиеЕИС.ЕстьПодсистемаДляЗаказчиков();
	
КонецФункции

// Есть подключенные к ЛК ЕИС организации.
// 
// Возвращаемое значение:
//  Булево - Есть подключенные организации
Функция ЕстьПодключенныеОрганизации() Экспорт
	
	Результат = Ложь;
	Если ЭлектронноеАктированиеЕИС.ИспользоватьЭлектронноеАктированиеВЕИС() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	НастройкиОбменаЕИС.Организация КАК Организация
		               |ИЗ
		               |	РегистрСведений.НастройкиОбменаЕИС КАК НастройкиОбменаЕИС
		               |ГДЕ
		               |	НастройкиОбменаЕИС.ОбменВключен = ИСТИНА";
		УстановитьПривилегированныйРежим(Истина);
		Выборка = Запрос.Выполнить().Выбрать();
		УстановитьПривилегированныйРежим(Ложь);
		Результат = Выборка.Следующий();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// см. ЭлектронноеАктированиеЕИСПереопределяемый.ДоговорКонтрагентаИсточникаКоманды 
Функция ДоговорКонтрагентаИсточникаКоманды(ИсточникКоманды) Экспорт
	
	ДоговорКонтрагента = Неопределено;
	ЭлектронноеАктированиеЕИСПереопределяемый.
		ДоговорКонтрагентаИсточникаКоманды(ИсточникКоманды, ДоговорКонтрагента);
	Возврат ДоговорКонтрагента;
	
КонецФункции

// см. ЭлектронноеАктированиеЕИС.ОбменПоОрганизацииВключен
Функция ОбменПоОрганизацииВключен(Организация) Экспорт
	
	Возврат ЭлектронноеАктированиеЕИС.ОбменПоОрганизацииВключен(Организация);
	
КонецФункции

// Места поставки документа.
// 
// Параметры:
//  Документ - ДокументСсылка - ссылка на документ.
// 
// Возвращаемое значение:
//  Массив - места поставки документа.
Функция МестаПоставкиДокумента(Документ) Экспорт
	
	МестаПоставки = Новый Массив;
	ЭлектронноеАктированиеЕИСПереопределяемый.
		ЗаполнитьМестаПоставкиДокумента(Документ, МестаПоставки);
		
	Возврат МестаПоставки;
	
КонецФункции

// Для документа заполняются места поставки.
// 
// Параметры:
//  Документ - ДокументСсылка - ссылка на документ.
// 
// Возвращаемое значение:
//  Булево - Истина, если для документа заполняются места поставки.
Функция ДляДокументаЗаполняютсяМестаПоставки(Документ) Экспорт
	
	Результат = Ложь;
	ЭлектронноеАктированиеЕИСПереопределяемый.
		ДляДокументаЗаполняютсяМестаПоставки(Документ, Результат);
		
	Возврат Результат;
	
КонецФункции

// Для документа заполняется результат судебного решения.
// Судебное решение заполняется для УПД и исправлений.
// 
// Параметры:
//  Документ - ДокументСсылка - ссылка на документ.
// 
// Возвращаемое значение:
//  Булево - Истина, если для документа заполняется результат судебного решения.
Функция ДляДокументаОтображаетсяСудебноеРешение(Документ) Экспорт
	
	Результат = Ложь;
	ЭлектронноеАктированиеЕИСПереопределяемый.
		ДляДокументаЗаполняетсяСудебноеРешение(Документ, Результат);
		
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеКонтрактаПоДоговору(Договор) Экспорт
	
	Госконтракт = Договор.ГосударственныйКонтракт;
	
	Если ЗначениеЗаполнено(Госконтракт) Тогда
		Шаблон = НСтр("ru = 'Данные для электронного актирования по контракту №%1 от %2'");
		Представление = СтрШаблон(Шаблон, Госконтракт.Номер,
			Формат(Госконтракт.ДатаЗаключенияКонтракта, "ДФ=dd.MM.yyyy;"));
		Возврат Представление;
	Иначе
		Возврат "<нет данных о контракте>";
	КонецЕсли;
	
КонецФункции

Функция ИспользуетсяНесколькоОрганизаций() Экспорт
	
	Возврат ОбщегоНазначенияБЭД.ИспользуетсяНесколькоОрганизаций();
	
КонецФункции

Процедура СкрытьЭлементыФормыПриИспользованииОднойОрганизации(Форма, ИмяЭлементаИлиМассив) Экспорт
		
	Если НЕ ИспользуетсяНесколькоОрганизаций() Тогда
		
		Если ТипЗнч(ИмяЭлементаИлиМассив) = Тип("Массив") Тогда
			
			Для Каждого ИмяОдногоЭлемента Из ИмяЭлементаИлиМассив Цикл
				
				СкрываемыйЭлемент = Форма.Элементы.Найти(ИмяОдногоЭлемента);
				
				Если СкрываемыйЭлемент <> Неопределено Тогда
					СкрываемыйЭлемент.Видимость = Ложь;
				КонецЕсли;
				
			КонецЦикла; 
			
		ИначеЕсли ТипЗнч(ИмяЭлементаИлиМассив) = Тип("Строка") Тогда
			
			СкрываемыйЭлемент = Форма.Элементы.Найти(ИмяЭлементаИлиМассив);
			
			Если СкрываемыйЭлемент <> Неопределено Тогда
				
				СкрываемыйЭлемент.Видимость = Ложь;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДанныеГосударственногоКонтракта(СсылкаНаКонтракт, ВВидеСтроки=Ложь) Экспорт
	
	Возврат ЭлектронноеАктированиеЕИС.ДанныеГосударственногоКонтракта(СсылкаНаКонтракт, ВВидеСтроки);
	
КонецФункции

Функция ДанныеСтрокКонтрактаПоНоменклатуре(ГосударственныйКонтрактЕИС, Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ГосударственныеКонтрактыЕИСНоменклатураОбъектовЗакупки.Идентификатор КАК Идентификатор,
	               |	ГосударственныеКонтрактыЕИСНоменклатураОбъектовЗакупки.Номенклатура КАК Номенклатура,
	               |	ГосударственныеКонтрактыЕИСНоменклатураОбъектовЗакупки.Количество КАК Количество,
	               |	ГосударственныеКонтрактыЕИСОбъектыЗакупки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ГосударственныеКонтрактыЕИСОбъектыЗакупки.Количество КАК Количество1,
	               |	ГосударственныеКонтрактыЕИСОбъектыЗакупки.Цена КАК Цена,
	               |	ГосударственныеКонтрактыЕИСОбъектыЗакупки.Сумма КАК Сумма,
	               |	ГосударственныеКонтрактыЕИСОбъектыЗакупки.КодТовараДляЕИС КАК КодТовараДляЕИС,
	               |	ГосударственныеКонтрактыЕИСОбъектыЗакупки.СтавкаНДС КАК СтавкаНДС,
	               |	ГосударственныеКонтрактыЕИСОбъектыЗакупки.Тип КАК Тип
	               |ИЗ
	               |	&ГосударственныеКонтрактыНоменклатураОбъектовЗакупки КАК ГосударственныеКонтрактыЕИСНоменклатураОбъектовЗакупки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ &ГосударственныеКонтрактыОбъектыЗакупки КАК ГосударственныеКонтрактыЕИСОбъектыЗакупки
	               |		ПО ГосударственныеКонтрактыЕИСНоменклатураОбъектовЗакупки.Идентификатор = ГосударственныеКонтрактыЕИСОбъектыЗакупки.Идентификатор
	               |ГДЕ
	               |	ГосударственныеКонтрактыЕИСНоменклатураОбъектовЗакупки.Ссылка = &ГосКонтрактСсылка
	               |	И ГосударственныеКонтрактыЕИСНоменклатураОбъектовЗакупки.Номенклатура = &Номенклатура";
	
	ИмяСправочникаГосударственныеКонтракты = ОбщегоНазначенияБЭД.ИмяПрикладногоСправочника("ГосударственныеКонтракты");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ГосударственныеКонтрактыОбъектыЗакупки", "Справочник." + ИмяСправочникаГосударственныеКонтракты + ".ОбъектыЗакупки");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ГосударственныеКонтрактыНоменклатураОбъектовЗакупки", "Справочник." + ИмяСправочникаГосударственныеКонтракты + ".НоменклатураОбъектовЗакупки");
	
	Запрос.УстановитьПараметр("ГосКонтрактСсылка", ГосударственныйКонтрактЕИС);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	ИдентификаторыСтрокКонтракта = Запрос.Выполнить().Выгрузить();
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ИдентификаторыСтрокКонтракта);
	
КонецФункции

Функция НайтиГосударственныйКонтрактПоВладельцу(ВладелецКонтракта) Экспорт
	
	Возврат ЭлектронноеАктированиеЕИС.НайтиГосударственныйКонтрактПоВладельцу(ВладелецКонтракта);
	
КонецФункции

Функция ПодписантыЕИС(Объект) Экспорт
	
	Возврат ЭлектронноеАктированиеЕИС.ПодписантыЕИС(Объект);
	
КонецФункции

Функция ПриложенныеДокументыДляЕИС(Объект) Экспорт
	
	ТаблицаФайлов = ЭлектронноеАктированиеЕИС.ДанныеФайловПрисоединенныхКДокументу(Объект);
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаФайлов);
	
КонецФункции

Функция МестаПоставкиДляЕИС(Объект) Экспорт
	
	Возврат ЭлектронноеАктированиеЕИС.МестаПоставкиДляЕИС(Объект);
	
КонецФункции

// При изменении идентификатора для актирования ЕИС.
// 
// Параметры:
//  СписокВыбора - СписокЗначений - список выбора.
//  ТабЧасть - Строка - имя табличной части.
//  СтрокаТаблицы - СтрокаТаблицыЗначений - строка таблицы.
Процедура ПриИзмененииИдентификатораДляАктированияЕИС(СписокВыбора, ТабЧасть, СтрокаТаблицы) Экспорт
	
	ИдентификаторДляАктированияЕИС = СтрокаТаблицы.ПредставлениеДляАктированияЕИС;
	СтрокаТаблицы.ИдентификаторДляАктированияЕИС = ИдентификаторДляАктированияЕИС;
	Элемент = СписокВыбора.НайтиПоЗначению(ИдентификаторДляАктированияЕИС);
	Если Элемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Представление = Элемент.Представление;
	СтрокаТаблицы.ПредставлениеДляАктированияЕИС = Представление;
	
КонецПроцедуры

// Данные строки контракта по идентификатору.
// 
// Параметры:
//  Договор - СправочникСсылка - ссылка на договор.
//  ИдентификаторСтрокиКонтракта - Строка - идентификатор строки контракта.
// 
// Возвращаемое значение:
//  Произвольный - Данные строки контракта по идентификатору
Функция ДанныеСтрокиКонтрактаПоИдентификатору(Договор, ИдентификаторСтрокиКонтракта) Экспорт
	
	Данные = ЭлектронноеАктированиеЕИС.
		ДанныеДляЗаполненияТабличнойЧастиДокумента(Договор, ИдентификаторСтрокиКонтракта);
	ДанныеСтрокКонтракта = ОбщегоНазначения.ТаблицаЗначенийВМассив(Данные);
	
	Возврат ДанныеСтрокКонтракта[0];
	
КонецФункции


// Возвращает государственный контракт договора. Если договор не назначен,
// то возвращается пустая ссылка.
// 
// Параметры:
//  Договор - ОпределяемыйТип.ДоговорСКонтрагентомЭДО - Договор
// 
// Возвращаемое значение:
//  ОпределяемыйТип.ГосударственныеКонтрактыБЭД - ссылка на государственный контракт договора.
Функция ГосударственныйКонтрактДоговора(Договор) Экспорт
	
	Возврат ЭлектронноеАктированиеЕИС.ГосударственныйКонтрактДоговора(Договор);
	
КонецФункции

#КонецОбласти
